In [1]:
# Import SQLAlchemy `automap` and other dependencies
import sqlalchemy
import pandas as pd
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, inspect
%matplotlib notebook
%matplotlib inline
import matplotlib.pyplot as plt

In [2]:
#conda install psycopg2
#this installed application for postgres connection

#hiding password
from page_key import my_page_key

ModuleNotFoundError: No module named 'page_key'

In [3]:
username='postgres'
password= 
dbname='EmployeeDB'
engine = create_engine(f'postgres://{username}:{password}@localhost/{dbname}')

In [4]:
connection = engine.connect()

In [5]:
# Create the inspector and connect it to the engine
inspector = inspect(engine)

In [6]:
# Collect the names of tables within the database
inspector.get_table_names()

['employees', 'dept_emp', 'departments', 'dept_manager', 'salaries', 'titles']

In [7]:
#use pandas to read dql table, then drop duplicate employee numbers for analysis
salaries_df = pd.read_sql_table('salaries', connection)
salaries_df2 = pd.DataFrame(salaries_df)
salaries_df3 = salaries_df2.drop_duplicates('emp_no')
salaries_df3.head(10)

   emp_no      salary  from_date    to_date
0   10001  $60,117.00 1986-06-26 1987-06-26
1   10002  $65,828.00 1996-08-03 1997-08-03
2   10003  $40,006.00 1995-12-03 1996-12-02
3   10004  $40,054.00 1986-12-01 1987-12-01
4   10005  $78,228.00 1989-09-12 1990-09-12
5   10006  $40,000.00 1990-08-05 1991-08-05
6   10007  $56,724.00 1989-02-10 1990-02-10
7   10008  $46,671.00 1998-03-11 1999-03-11
8   10009  $60,929.00 1985-02-18 1986-02-18
9   10010  $72,488.00 1996-11-24 1997-11-24

In [8]:
#use pandas to read dql table, then drop duplicate employee numbers for analysis
titles_df = pd.read_sql_table('titles', connection)
titles_df2 = pd.DataFrame(titles_df)
titles_df3 = titles_df2.drop_duplicates('emp_no')
titles_df3.head(10)

    emp_no               title  from_date    to_date
0    10001     Senior Engineer 1986-06-26        NaT
1    10002               Staff 1996-08-03        NaT
2    10003     Senior Engineer 1995-12-03        NaT
3    10004            Engineer 1986-12-01 1995-12-01
5    10005        Senior Staff 1996-09-12        NaT
7    10006     Senior Engineer 1990-08-05        NaT
8    10007        Senior Staff 1996-02-11        NaT
10   10008  Assistant Engineer 1998-03-11 2000-07-31
11   10009  Assistant Engineer 1985-02-18 1990-02-18
14   10010            Engineer 1996-11-24        NaT

In [9]:
#use pandas to read dql table, then drop duplicate employee numbers for analysis
employees_df = pd.read_sql_table('employees', connection)
employees_df2 = pd.DataFrame(employees_df)
employees_df3 = employees_df2.drop_duplicates('emp_no')
employees_df3.head(10)

   emp_no birth_date first_name  last_name gender  hire_date
0   10001 1953-09-02     Georgi    Facello      M 1986-06-26
1   10002 1964-06-02    Bezalel     Simmel      F 1985-11-21
2   10003 1959-12-03      Parto    Bamford      M 1986-08-28
3   10004 1954-05-01  Chirstian    Koblick      M 1986-12-01
4   10005 1955-01-21    Kyoichi   Maliniak      M 1989-09-12
5   10006 1953-04-20     Anneke    Preusig      F 1989-06-02
6   10007 1957-05-23    Tzvetan  Zielinski      F 1989-02-10
7   10008 1958-02-19     Saniya   Kalloufi      M 1994-09-15
8   10009 1952-04-19     Sumant       Peac      F 1985-02-18
9   10010 1963-06-01  Duangkaew   Piveteau      F 1989-08-24

In [10]:
#merge each table on employee number 
mer_df = pd.merge(titles_df3, salaries_df3,how='left',on='emp_no')
mer_df2 = mer_df.set_index('emp_no')
mer_df2

,title,from_date_x,to_date_x,salary,from_date_y,to_date_y
emp_no,,,,,,
10001,Senior Engineer,1986-06-26,NaT,"$60,117.00",1986-06-26,1987-06-26
10002,Staff,1996-08-03,NaT,"$65,828.00",1996-08-03,1997-08-03
10003,Senior Engineer,1995-12-03,NaT,"$40,006.00",1995-12-03,1996-12-02
10004,Engineer,1986-12-01,1995-12-01,"$40,054.00",1986-12-01,1987-12-01
10005,Senior Staff,1996-09-12,NaT,"$78,228.00",1989-09-12,1990-09-12
...,...,...,...,...,...,...
499995,Engineer,1997-06-02,NaT,"$40,000.00",1997-06-02,1998-06-02
499996,Engineer,1996-05-13,2002-05-13,"$58,058.00",1996-05-13,1997-05-13
499997,Engineer,1987-08-30,1992-08-29,"$49,597.00",1987-08-30,1988-08-29
499998,Senior Staff,1998-12-27,NaT,"$40,000.00",1993-12-27,1994-12-27
499999,Engineer,1997-11-30,NaT,"$63,707.00",1997-11-30,1998-11-30

In [11]:
list(mer_df2)

['title', 'from_date_x', 'to_date_x', 'salary', 'from_date_y', 'to_date_y']

In [12]:
mer_df2 = mer_df2.dropna()

In [13]:
output=mer_df2.groupby(by=['title'])['salary'].describe()
output.head()

                    count unique         top   freq
title
Assistant Engineer  11540   6353  $40,000.00   4424
Engineer            80315  25562  $40,000.00  30866
Manager                15     13  $40,000.00      3
Senior Engineer      6061   3582  $40,000.00   2259
Senior Staff        10822   7660  $40,000.00   2550

In [14]:
x=mer_df2['salary']

In [15]:
print x

SyntaxError: Missing parentheses in call to 'print'. Did you mean print(x)? (<ipython-input-15-0b640320f694>, line 1)

In [16]:
import matplotlib.pyplot as plt
import numpy as np
from matplotlib import colors
from matplotlib.ticker import PercentFormatter

In [17]:
#also = forpanbar.plot.bar(legend=False,rot=50)
#also

#plt.xlabel("Title")
#plt.ylabel("Salary")
#plt.title("Average Salary by Title")
#plt.savefig('barplot1')

In [ ]:
plt.hist(x, bins=7)

(array([61067., 15104., 13673., 12304., 10443.,  8672.,  6193.]),
 array([    0.        ,  5022.14285714, 10044.28571429, 15066.42857143,
        20088.57142857, 25110.71428571, 30132.85714286, 35155.        ]),
 <a list of 7 Patch objects>)

In [ ]:
plt.show()